app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `practicum_classes`
WHERE `status` = 'active'
---
    private function countActiveClasses(BaseConnection $db): int
    {
        if (! $db->tableExists('practicum_classes')) {
            return 0;
        }

        return (int) $db->table('practicum_classes')
            ->where('status', 'active')
            ->countAllResults();

SELECT `pc`.`id`, `pc`.`class_name`, `pc`.`status`, `c`.`course_name`
FROM `practicum_classes` `pc`
LEFT JOIN `courses` `c` ON `c`.`id` = `pc`.`course_id`
WHERE `pc`.`status` = 'active'
ORDER BY `pc`.`id` ASC
---
    private function buildStatusRows(BaseConnection $db): array
    {
        if (! $db->tableExists('practicum_classes') || ! $db->tableExists('courses')) {
            return $this->fallbackStatusRows();
        }

        try {
            $classes = $db->table('practicum_classes pc')
                ->select('pc.id, pc.class_name, pc.status, c.course_name')
                ->join('courses c', 'c.id = pc.course_id', 'left')
                ->where('pc.status', 'active')
                ->orderBy('pc.id', 'ASC')
                ->get()
                ->getResultArray();