app/Models/ActivityLogModel.php

    public function logActivity(?int $userId, string $activity, ?string $description = null): bool
    {
        $request = service('request');

        return $this->insert([
            'user_id'     => $userId,
            'activity'    => $activity,
            'description' => $description,
            'ip_address'  => $request->getIPAddress(),
            'user_agent'  => $request->getUserAgent()->getAgentString(),
            'created_at'  => date('Y-m-d H:i:s'),
        ]) !== false;
---
INSERT INTO `activity_logs` (`user_id`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES (4, 'User berhasil login.', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/148.0.0.0 Safari/537.36 Edg/148.0.0.0', '2026-06-04 02:33:51')