app/Models/AssistantDashboardModel.php

    private function loadStudentRows(array $classRows, array $groupRows): array
    {
        $db = db_connect();

        if (! $db->tableExists('class_students')) {
            return [];
        }

        $classIds = array_values(array_map(static fn (array $row): int => (int) ($row['id'] ?? 0), $classRows));
        $groupIds = array_values(array_map(static fn (array $row): int => (int) ($row['id'] ?? 0), $groupRows));

        $builder = $db->table('class_students cs');
// Skema terbaru: class_students: practicum_class_id, student_nim, group_id
        $builder->select('cs.practicum_class_id AS class_id, cs.student_nim AS student_id, u.login_identifier AS student_number, u.full_name');
$builder->join('users u', 'u.id = cs.student_nim', 'left');

        if ($classIds !== []) {
            $builder->whereIn('cs.practicum_class_id', $classIds);
        }

        if ($groupIds !== [] && $db->fieldExists('group_id', 'class_students')) {
            $builder->orWhereIn('cs.group_id', $groupIds);
        }

        return $builder->get()->getResultArray();
---
SELECT `cs`.`practicum_class_id` AS `class_id`, `cs`.`student_nim` AS `student_id`, `u`.`login_identifier` AS `student_number`, `u`.`full_name`
FROM `class_students` `cs`
LEFT JOIN `users` `u` ON `u`.`id` = `cs`.`student_nim`

    private function loadActivityRows(string $userId, array $classRows): array
    {
        $db = db_connect();

        if (! $db->tableExists('activity_logs')) {
            return [];
        }

$rows = $db->table('activity_logs')
            ->select('action, module, description, created_at')
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(8)
            ->get()
            ->getResultArray();
---
SELECT `action`, `module`, `description`, `created_at`
FROM `activity_logs`
WHERE `user_id` = '0000000004'
ORDER BY `created_at` DESC
 LIMIT 8