app/Models/StudentDashboardModel.php

SELECT *
FROM `users`
WHERE `id` = '0000000005'
---
    private function resolveStudentProfile(string $userId, string $displayName): array
    {
        $db = db_connect();
        $profile = [
            'student_id' => $userId,
            'user_id' => $userId,
            'student_number' => '-',
            'full_name' => $displayName !== '' ? $displayName : 'Mahasiswa',
            'study_program_id' => null,
            'study_program' => '-',
            'semester_active' => '',
            'academic_year_active' => '',
        ];

        if ($userId === '') {
            return $profile;
        }

        $userRow = null;
        if ($db->tableExists('users')) {
            $userRow = $db->table('users')->where('id', $userId)->get()->getRowArray();

SELECT `practicum_class_id`
FROM `final_scores`
WHERE `student_id` = 5
---
            }
            $classIdField = $this->findFirstField('final_scores', ['class_id', 'practicum_class_id']);
            if ($classIdField !== null) {
                $rows = $db->table('final_scores')
                    ->select($classIdField)
                    ->where($studentField, $studentId)
                    ->get()
                    ->getResultArray();

SELECT `practicum_class_id`
FROM `score_entries`
WHERE `student_id` = 5
---
            }
            $classIdField = $this->findFirstField('score_entries', ['class_id', 'practicum_class_id']);
            if ($classIdField !== null) {
                $rows = $db->table('score_entries')
                    ->select($classIdField)
                    ->where($studentField, $studentId)
                    ->get()
                    ->getResultArray();