app/Models/UserModel.php

    public function getUserRoleSlugs(string $userId): array
    {
        $builder = $this->db->table('user_roles ur');
        $builder->select('r.code');
        $builder->join('roles r', 'r.id = ur.role_id', 'inner');
        $builder->where('ur.user_id', $userId);
        $builder->orderBy('ur.id', 'ASC');

        $rows = $builder->get()->getResultArray();
---
SELECT `r`.`code`
FROM `user_roles` `ur`
INNER JOIN `roles` `r` ON `r`.`id` = `ur`.`role_id`
WHERE `ur`.`user_id` = '0000000004'
ORDER BY `ur`.`id` ASC

    public function touchLastLogin(string $userId): bool
    {
        return $this->update($userId, ['last_login_at' => date('Y-m-d H:i:s')]) !== false;
---
UPDATE `users` SET `last_login_at` = '2026-06-04 02:33:51', `updated_at` = '2026-06-04 02:33:51'
WHERE `users`.`id` IN ('0000000004')